Ran Plan for 2 projects:

1. project: `nonprod` dir: `.` workspace: `default`
1. project: `prod` dir: `.` workspace: `default`
---

### 1. project: `nonprod` dir: `.` workspace: `default`
**Plan Error**
```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/7/default/nonprod-default.tfplan" -var-file=tfvars/nonprod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/7/default': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.

╷
│ Error: Failed to read variables file
│ 
│ Given variables file
│ /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars does not exist.
╵

```

---
### 2. project: `prod` dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_policy" "step_functions_policy" {
        id               = "arn:aws:iam::481665084477:policy/anime_step_functions_policy"
        name             = "anime_step_functions_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss",
                          - "arn:aws:lambda:us-east-2:481665084477:function:process_content",
                          - "arn:aws:lambda:us-east-2:481665084477:function:store_data",
                          - "arn:aws:lambda:us-east-2:481665084477:function:render_video",
                          - "arn:aws:lambda:us-east-2:481665084477:function:save_video",
                          - "arn:aws:lambda:us-east-2:481665084477:function:start_instance",
                          - "arn:aws:lambda:us-east-2:481665084477:function:stop_instance",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.notify_post will be created
+ resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::481665084477:role/anime_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-2:481665084477:anime_post_notifications"
              + "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_sfn_state_machine.anime_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "anime_workflow" {
      ~ definition                = jsonencode(
            {
              - Comment = "State machine for automating anime post workflow"
              - StartAt = "FetchRSS"
              - States  = {
                  - CheckPost      = {
                      - Choices = [
                          - {
                              - Next         = "StartEC2"
                              - StringEquals = "anime_post_found"
                              - Variable     = "$.rssData.status"
                            },
                        ]
                      - Default = "EndWorkflow"
                      - Type    = "Choice"
                    }
                  - EndWorkflow    = {
                      - Type = "Succeed"
                    }
                  - FetchRSS       = {
                      - Next       = "CheckPost"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss"
                      - ResultPath = "$.rssData"
                      - Type       = "Task"
                    }
                  - ProcessContent = {
                      - Next       = "StoreData"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:process_content"
                      - ResultPath = "$.processedContent"
                      - Type       = "Task"
                    }
                  - RenderVideo    = {
                      - Next       = "SaveVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:render_video"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                  - SaveVideo      = {
                      - Next       = "StopEC2"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:save_video"
                      - ResultPath = "$.saveVideoResult"
                      - Type       = "Task"
                    }
                  - StartEC2       = {
                      - Next       = "ProcessContent"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:start_instance"
                      - ResultPath = "$.ec2StartResult"
                      - Type       = "Task"
                    }
                  - StopEC2        = {
                      - End        = true
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:stop_instance"
                      - ResultPath = "$.ec2StopResult"
                      - Type       = "Task"
                    }
                  - StoreData      = {
                      - Next       = "RenderVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:store_data"
                      - ResultPath = "$.storeResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow"
        name                      = "anime_workflow"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252Fsocialmedia_automation%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 2 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```